Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Any method parameter with no annotation will receive the method body.footnote:[Unless it is a <<path-parameter,URI template parameter>> or a <<context-objects,context object>>.], after it has been mapped from its HTTP representation to the Java type of the parameter.
ja_jp: アノテーションのないメソッドパラメーターはメソッドボディーを受け取ります。body.footnote:[ <<path-parameter,URI template parameter>> または<<context-objects,context object>>.] からマッピングされた後、 HTTP 表現をパラメーターの Java 型に変換します。

source: Any method parameter with no annotation will receive the method body.footnote:[Unless it is a xref:path-parameter[URI template parameter] or a xref:context-objects[context object].], after it has been mapped from its HTTP representation to the Java type of the parameter.
ja_jp: アノテーションのないメソッドパラメータは、HTTP表現からパラメータのJavaタイプにマッピングされた後、メソッドボディを受け取ります。footnote:[xref:path-parameter[URIテンプレートパラメータ] または xref:context-objects[コンテキストオブジェクト]でないかぎり。]

source: Any methods annotated with `@OnTextMessage`, `@OnBinaryMessage`, `@OnOpen`, and `@OnClose` outside a WebSocket endpoint are considered erroneous and will result in the build failing with an appropriate error message.
ja_jp: WebSocket エンドポイントの外部で `@OnTextMessage`、 `@OnBinaryMessage`、 `@OnOpen`、および `@OnClose` アノテーションが付与されたメソッドはエラーとみなされ、適切なエラーメッセージが表示されてビルドが失敗します。

source: Any number of `@OnError` methods: Invoked when an error occurs; that is when an endpoint callback throws a runtime error, or when a conversion errors occurs, or when a returned `io.smallrye.mutiny.Uni`/`io.smallrye.mutiny.Multi` receives a failure.
ja_jp: 任意の数の `@OnError` メソッド: エラーが発生したときに呼び出されます。つまり、エンドポイントコールバックがランタイムエラーをスローしたとき、変換エラーが発生したとき、または返された `io.smallrye.mutiny.Uni`/`io.smallrye.mutiny.Multi` が失敗を受け取ったときです。

source: Any of the <<context-objects,Context objects>>
ja_jp: <<context-objects,Context objects>> のいずれか

source: Any of the above extensions that operates with `BuildExtension.BuildContext` can leverage certain build time metadata that are generated during build. The built-in keys located in `io.quarkus.arc.processor.BuildExtension.Key` are:
ja_jp: `BuildExtension.BuildContext` で動作する上記のエクステンションはいずれも、ビルドタイムに生成される特定のビルドタイムメタデータを利用することができます。 `io.quarkus.arc.processor.BuildExtension.Key` にある組込キーは以下の通りです。

source: Any of the xref:context-objects[Context objects]
ja_jp: xref:context-objects[Contextオブジェクト] のいずれか

source: Any other annotation present on a bindings source class is ignored.
ja_jp: バインディングソースクラスに存在するその他のアノテーションは無視されます。

source: Any other class
ja_jp: その他のクラス

source: Any resource found will be added in the generated manifests. Global modifications (e.g. labels, annotations etc) will also be applied to those resources. If one of the provided resources has the same name as one of the generated ones, then the generated resource will be created on top of the provided resource, respecting existing content when possible (e.g. existing labels, annotations, environment variables, mounts, replicas etc).
ja_jp: 見つかったリソースは、生成されたマニフェストに追加されます。グローバルな変更(ラベルやアノテーションなど)は、それらのリソースにも適用されます。提供されたリソースの一つが、生成されたリソースの一つと同じ名前を持つ場合、生成されたリソースは提供されたリソースの上に作成され、可能な限り既存のコンテンツ(既存のラベル、アノテーション、環境変数、マウント、レプリカなど)を尊重します。

source: Any resource found will be added in the generated manifests. Global modifications (e.g. labels, annotations) will also be applied to those resources. If one of the provided resources has the same name as one of the generated ones, then the generated resource will be created on top of the provided resource, respecting existing content when possible (e.g. existing labels, annotations, environment variables, mounts, replicas etc).
ja_jp: 見つかったリソースは、生成されたマニフェストに追加されます。グローバルな変更 (ラベルやアノテーションなど) は、それらのリソースにも適用されます。提供されたリソースの一つが、生成されたリソースの一つと同じ名前を持つ場合、生成されたリソースは提供されたリソースの上に作成され、可能な限り既存のコンテンツ (既存のラベル、アノテーション、環境変数、マウント、レプリカなど) を尊重します。

source: Any thrown and <<exception-mapping, handled>> exception, or `null` (only for response filters).
ja_jp: 出力例外および <<exception-mapping, handled>> の例外または `null` (レスポンスフィルターのみ)。

source: Any thrown exception, or `null` (only for response filters)
ja_jp: 出力された例外、または `null` (レスポンスフィルターの場合のみ)

source: Any tutorial describing development activity should use `\{includes}/prerequisites.adoc` to ensure consistent language is used when describing prerequisites. Declared `prerequisites-` attributes can customize the final text.
ja_jp: 開発活動を説明するチュートリアルは、前提条件を説明するときに一貫した言語が使用されるように `\{includes}/prerequisites.adoc` を使用する必要があります。 `prerequisites-` 属性を宣言することで、最終的なテキストをカスタマイズすることができます。

source: Any type that can be converted to one of the two previous types using Reactive Type Converters
ja_jp: リアクティブ・タイプ・コンバータを使用して、前の2つのタイプのいずれかに変換できるすべてのタイプ

source: Any type which can be converted to one of the two previous types using Reactive Type Converters
ja_jp: リアクティブ型コンバータを使用して、前の2つの型のうちの1つに変換できる任意の型

source: Any type which has a constructor accepting a single argument of type `String` or `CharSequence`
ja_jp: `String` または `CharSequence` タイプの 1 つの引数を許可するコンストラクターを持つすべてのタイプ

source: Any type which has a static method named `of` which accepts a single argument of type `String`
ja_jp: `String` タイプの単一の引数を許可する 'of' という名前の静的メソッドを持つすべてのタイプ

source: Any type which has a static method named `valueOf` or `parse` which accepts a single argument of type `CharSequence` or `String`
ja_jp: `CharSequence` または `String` タイプの引数を許可する `valueOf` または `parse` という名前の静的メソッドを持つすべてのタイプ

source: Any user can access the `http://localhost:8080/api/users/me` endpoint, which returns a JSON payload with details about the user.
ja_jp: どのユーザーも `http://localhost:8080/api/users/me` エンドポイントにアクセスでき、ユーザーの詳細を含む JSON ペイロードが返されます。

source: Any user however that does not have the `admin` role will receive:
ja_jp: ただし、 `admin` ロールを持たないユーザーは次のものを受け取ります。

source: Any user is allowed to access the `http://localhost:8080/api/users/me` endpoint which basically returns a JSON payload with details about the user.
ja_jp: どのユーザーでも `http://localhost:8080/api/users/me` エンドポイントで、基本的にはユーザーに関する詳細な情報を含む JSON ペイロードを返します。

source: Any user with a valid access token can access the `http://localhost:8080/api/users/me` endpoint, which returns a JSON payload with user details:
ja_jp: 有効なアクセストークンを持つすべてのユーザーは、ユーザーの詳細を含む JSON ペイロードを返す `http://localhost:8080/api/users/me` エンドポイントにアクセスできます。

source: Any user with a valid token can access the `/api/users/me` endpoint. As a response, it returns a JSON document with user details obtained from the information in the token.
ja_jp: 有効なトークンを持つすべてのユーザーは、`/api/users/me` エンドポイントにアクセスできます。 レスポンスとして、トークンの情報から取得したユーザーの詳細を含む JSON ドキュメントを返します。

source: Any volume can be mounted with a simple configuration:
ja_jp: どんなボリュームでも、簡単な構成でマウントすることができます。

source: Any work performed by a method annotated in this way should be "compensatable" in the sense that if some service "cancels" the LRA then the service will be reliably notified that it should compensate for any work that it did. Each service is responsible for interpreting the notion of what it means to compensate, the only requirement is that it responds https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ParticipantStatus.html[appropriately] when it is notified that it should compensate. The service indicates how it should be notified by annotating one of its method with an https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/Compensate.html[@Compensate] annotation. Refer to the javadoc for the `@LRA` annotation for the details of how to control the outcome of an LRA.
ja_jp: このようにアノテーションされたメソッドが行った作業は、あるサービスがLRAを「キャンセル」した場合に、そのサービスが行った作業を補償すべきであると確実に通知されるという意味で、「補償可能」でなければなりません。各サービスは、「補償する」という概念を解釈する責任があります。唯一の要件は、補償すべきだと通知されたときに https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/ParticipantStatus.html[適切] に対応することです。サービスは、メソッドの1つに https://download.eclipse.org/microprofile/microprofile-lra-1.0/apidocs/org/eclipse/microprofile/lra/annotation/Compensate.html[@Compensate] アノテーションを付けることで、どのように通知されるべきかを示します。LRAの結果を制御する方法の詳細については、 `@LRA` アノテーションのjavadocを参照してください。

source: Any you files and directories you create under your zip directory will be included within `function.zip`
ja_jp: zipディレクトリーの下に作成したファイルやディレクトリーは、すべて `function.zip` に含まれます。

source: Anyone can post to this list. The subscribers are only trusted individuals from the Quarkus community who will handle the resolution of any reported security issues in confidence. In your report, please note how you would like to be credited for discovering the issue and the details of any embargo you would like to impose. Currently the security response teams for the following distributions are subscribed to this list and will respond to your report:
ja_jp: このリストには誰でも投稿できます。このリストの購読者は、Quarkusコミュニティの信頼できる個人のみで、報告されたセキュリティー問題の解決を秘密を守って処理します。報告においては、問題を発見したことについてどのようにクレジットされたいか、またエンバーゴ処理を適用したい場合はその詳細を記載してください。現在、以下のディストリビューションのセキュリティー対応チームがこのリストに登録されており、あなたのレポートに対応しています。

source: Anyway, this issue shouldn't prevent you from testing your existing applications and will be fixed in our Final release.
ja_jp: いずれにしても、この課題は既存のアプリケーションのテストを妨げるものではなく、最終リリースで修正される予定です。

source: Apache Avro is a data serialization system. Data structures are described using schemas. The first thing we need to do is to create a schema describing the `Movie` structure. Create a file called `src/main/avro/movie.avsc` with the schema for our record (Kafka message):
ja_jp: Apache Avro はデータシリアル化システムです。データ構造はスキーマを使用して記述されます。最初に `Movie` 構造を記述するスキーマを作成する必要があります。レコードのスキーマ (Kafka メッセージ) を使用して、 `src/main/avro/movie.avsc` というファイルを作成します。

source: Apache Cassandra Client
ja_jp: Apache Cassandraクライアント

source: Apache Cassandra® is a free and open-source, distributed, wide column store, NoSQL database management system designed to handle large amounts of data across many commodity servers, providing high availability with no single point of failure.
ja_jp: Apache Cassandra®は、フリーでオープンソースの分散型ワイドカラムストアのNoSQLデータベース管理システムで、多くのコモディティサーバーにまたがる大量のデータを処理するように設計されており、単一障害点のない高可用性を提供します。

source: Apache Kafka Client
ja_jp: Apache Kafka クライアント

source: Apache Kafka Reference Guide
ja_jp: Apache Kafka リファレンスガイド

source: Apache Maven 3.9.3+
ja_jp: Apache Maven 3.9.3 以降

source: Apache Polaris has achieved a major milestone: graduating from the Apache Incubator to become a new Top-Level Project (TLP) within the Apache Software Foundation (ASF). This graduation signifies not only the maturity and community adoption of the project but also its successful integration into the _Apache Way_ of governance and operation.
ja_jp: Apache Polaris は、Apache Incubator から卒業し、Apache Software Foundation (ASF) 内で新しいトップレベルプロジェクト (TLP) となるという、大きな節目を達成しました。この卒業は、プロジェクトの成熟度とコミュニティへの採用だけでなく、ガバナンスと運用における _Apache Way_ への統合が成功したことを示しています。

source: Apache Polaris is powered by Quarkus
ja_jp: Apache Polaris は Quarkus を採用しています

source: Apache Polaris, the open-source Iceberg catalog, graduated to an Apache Top-Level Project with Quarkus as its cloud-native foundation. Discover how Polaris leverages Quarkus for performance, extensibility, and developer productivity.
ja_jp: オープンソースの Iceberg カタログである Apache Polaris は、Quarkus をクラウドネイティブ基盤として、Apache トップレベルプロジェクトに昇格しました。Polaris が Quarkus をどのように活用して、パフォーマンス、拡張性、開発者の生産性を向上させているかをご覧ください。

source: Apache Pulsar Reference Guide
ja_jp: Apache Pulsar リファレンス・ガイド

source: Apache-2.0 License
ja_jp: Apache-2.0 ライセンス

source: Apart from a lot of internal improvements, the most visible change is the new far improved output when you build a native executable.
ja_jp: 多くの内部改良を除けば、最も目に見える変化は、ネイティブ実行可能ファイルをビルドしたときの出力が新しくはるかに改善されたことです。

source: Apart from adding a card and a page, extensions can add a tab to the footer. This is useful for things that are happening continuously. A page will disconnect from the DOM (and maybe the backend) when navigating away from that page (or webcomponent), and a log in the footer will be permanently connected to the DOM, as it's always part of the view (or app)
ja_jp: カードとページを追加する以外に、エクステンションはフッターにタブを追加できます。これは、継続的に発生する事柄に便利です。ページ (または Web コンポーネント) から移動すると、ページは DOM (および場合によってはバックエンド) から切断されますが、フッターのログは常にビュー (またはアプリ) の一部であるため、DOM に永続的に接続されます。

source: Apart from adding a card and a page, extensions can add a tab to the footer. This is useful for things that are happening continuously. A page will lose connection to the backend when navigating away from that page, and a log in the footer will be permanently connected.
ja_jp: エクステンションは、カードとページ以外にも、フッターにタブを追加できます。これは、継続的に発生する事柄に便利です。ページから移動すると、ページはバックエンドへの接続を失いますが、フッターのログは永続的に接続されたままになります。

source: Apart from application-specific metrics described in this guide, you may also use built-in metrics exposed by various Quarkus extensions. These are described in the guide for each particular extension that supports built-in metrics.
ja_jp: このガイドで説明しているアプリケーション固有のメトリクスとは別に、Quarkusの様々なエクステンションで公開されているビルトインメトリクスを使用することもできます。これらについては、ビルトインメトリクスをサポートする各エクステンションのガイドに記載されています。

source: Apart from application-specific metrics, which are described in this guide, you may also utilize built-in metrics exposed by various Quarkus extensions. These are described in the guide for each particular extension that supports built-in metrics.
ja_jp: このガイドで説明するアプリケーション固有のメトリクスとは別に、Quarkusのさまざまなエクステンションによって公開されているビルトインメトリクスを利用することもできます。これらについては、ビルトインメトリクスをサポートしている各エクステンションのガイドで説明します。

source: Apart from the usual `scope`, `redirect_uri` and `state` query initial redirect parameters, other parameters may have to be included, and the map `quarkus.oidc.authentication.extra-params` property can help, for example, `quarkus.oidc.authentication.extra-params.prompt=consent`, etc.
ja_jp: 通常の `scope`、 `redirect_uri`、 `state` クエリー初期リダイレクトパラメーター以外に、他のパラメーターを含める必要がある場合があります。その場合、マップ形式の `quarkus.oidc.authentication.extra-params` プロパティーが役立ちます (例: `quarkus.oidc.authentication.extra-params.prompt=consent` など)。

source: Apart from these configuration options, further configuration and customization can be applied by observing a `CriteriaBuilderConfiguration` or `EntityViewConfiguration` events and applying customizations on these objects. The various customization use cases can be found in the link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#quarkus-customization[Quarkus section of the entity-view documentation].
ja_jp: これらの設定オプションとは別に、 `CriteriaBuilderConfiguration` や `EntityViewConfiguration` のイベントを観測し、これらのオブジェクトにカスタマイズを適用することで、さらなる設定やカスタマイズを適用することができます。様々なカスタマイズの使用例については、 link:https://persistence.blazebit.com/documentation/entity-view/manual/en_US/index.html#quarkus-customization[エンティティビューのドキュメントのQuarkusのセクション] を参照してください。

source: Apicurio Registry 3.x changed the schema ID format from **8-byte (long)** to **4-byte (int)** identifiers. This means messages produced with v2 cannot be consumed by v3 applications (and vice versa) without explicit configuration.
ja_jp: Apicurio Registry 3.x では、スキーマ ID 形式が *8 バイト (long)* から *4 バイト (int)* 識別子に変更されました。これは、明示的な設定なしには、v2 で生成されたメッセージを v3 アプリケーションで消費できないこと (およびその逆も) を意味します。

source: Apicurio Registry 3.x introduces a **breaking change in schema ID format** from 8-byte (long) to 4-byte (int) identifiers. This affects message compatibility between v2 and v3 producers/consumers.
ja_jp: Apicurio Registry 3.x では、スキーマ ID 形式が 8 バイト (long) から 4 バイト (int) 識別子に変わる *破壊的な変更* が導入されています。これは、v2 と v3 のプロデューサー/コンシューマー間のメッセージ互換性に影響します。

source: Apicurio Registry V3 Migration
ja_jp: Apicurio Registry V3 への移行

source: Apicurio Registry provides an `OptimisticFallbackIdHandler` that can help with gradual migration from v2 to v3. This handler:
ja_jp: Apicurio Registry は、v2 から v3 への段階的な移行に役立つ `OptimisticFallbackIdHandler` を提供します。このハンドラーは次のとおりです。

source: Apicurio Registry, in addition to its native API, also exposes an endpoint that is API-compatible with Confluent Schema Registry. Therefore, this automatic configuration works both for Apicurio Registry serde and Confluent Schema Registry serde.
ja_jp: ネイティブ API に加えて、Apicurio Registry は Confluent Schema Registry と API 互換のエンドポイントも公開します。したがって、この自動設定は、Apicurio Registry serde と Confluent Schema Registry serde の両方で機能します。

source: Apicurio Schema Registry: http://localhost:8086[http://localhost:8086^]
ja_jp: Apicurio Schema Registry: link:http://localhost:8086[http://localhost:8086, window=_blank]

source: App Engine Flexible Custom Runtimes deploys your application as a Docker container, you can choose to deploy one of the Dockerfile provided inside your application.
ja_jp: App Engineフレキシブル環境カスタムランタイムは、アプリケーションをDockerコンテナーとしてデプロイしますが、アプリケーション内で提供されるDockerfileのいずれかを選択してデプロイすることができます。

source: App Engine Flexible Custom Runtimes uses a Docker image to run your application.
ja_jp: App Engineフレキシブル環境カスタムランタイムはDockerイメージを使用してアプリケーションを実行します。

source: App Engine Flexible custom runtimes support link:https://cloud.google.com/appengine/docs/flexible/custom-runtimes/configuring-your-app-with-app-yaml#updated_health_checks[health checks], it is strongly advised to provide them thanks to Quarkus xref:microprofile-health.adoc[Microprofile Health] support.
ja_jp: App Engine Flexibleカスタムランタイムは link:https://cloud.google.com/appengine/docs/flexible/custom-runtimes/configuring-your-app-with-app-yaml#updated_health_checks[ヘルスチェック] をサポートしています。 Quarkus xref:microprofile-health.adoc[Microprofile Health] サポートのおかげで、それらを提供することを強くお勧めします。

source: App Engine Flexible custom runtimes support link:https://cloud.google.com/appengine/docs/flexible/custom-runtimes/configuring-your-app-with-app-yaml#updated_health_checks[health checks], it is strongly advised to provide them thanks to Quarkus xref:smallrye-health.adoc[Smallrye Health] support.
ja_jp: App Engineフレキシブル環境カスタムランタイムは link:https://cloud.google.com/appengine/docs/flexible/custom-runtimes/configuring-your-app-with-app-yaml#updated_health_checks[ヘルスチェック]をサポートしていますが、Quarkus link:smallrye-health.html[Smallrye Health]のサポートによりヘルスチェックを行うことが強く推奨されます。

source: App Engine Flexible custom runtimes support link:https://cloud.google.com/appengine/docs/flexible/reference/app-yaml?tab=java#updated_health_checks[health checks], it is strongly advised to provide them thanks to Quarkus xref:smallrye-health.adoc[SmallRye Health] support.
ja_jp: App Engine Flexible カスタム ランタイムは link:https://cloud.google.com/appengine/docs/flexible/reference/app-yaml?tab=java#updated_health_checks[ヘルス チェック] をサポートします。 Quarkus xref:smallrye-health.adoc[SmallRye Health] サポートを用いてヘルス チェックを提供することを強くお勧めします。

source: App Engine Flexible custom runtimes support link:https://cloud.google.com/appengine/docs/flexible/reference/app-yaml?tab=java#updated_health_checks[health checks], it is strongly advised to provide them thanks to Quarkus xref:smallrye-health.adoc[Smallrye Health] support.
ja_jp: App Engineフレキシブルカスタムランタイムは link:https://cloud.google.com/appengine/docs/flexible/reference/app-yaml?tab=java#updated_health_checks[ヘルスチェック]をサポートしていますが、Quarkus link:smallrye-health.html[Smallrye Health]のサポートによりヘルスチェックを行うことが強く推奨されます。

source: App Engine Standard does not support the default Quarkus' specific packaging layout, therefore, you must set up your application to be packaged as an uber-jar via your `application.properties` file:
ja_jp: App Engineスタンダード環境は、デフォルトのQuarkus固有のパッケージングレイアウトをサポートしていないため、アプリケーションをuber-jarとしてパッケージングするよう、 `application.properties` ファイルを設定する必要があります。

source: AppCDS (Legacy)
ja_jp: AppCDS (レガシー)

source: AppCDS has improved significantly in the latest JDK releases. This means that to ensure the best possible improvements from it, make sure your projects targets the highest possible Java version (ideally 17 or 21).
ja_jp: AppCDSは、最新のJDKリリースで大幅に改善されました。つまり、AppCDSから可能な限り最高の改善を得るためには、プロジェクトが可能な限り高いJavaバージョン（理想的には17または21）をターゲットにしていることを確認してください。

source: AppCDS in Quarkus
ja_jp: QuarkusにおけるAppCDS

source: AppCDS limitations
ja_jp: AppCDS の制限事項

source: AppCDS only caches class metadata, not method profiles or verification results
ja_jp: AppCDS はクラスのメタデータのみをキャッシュし、メソッドプロファイルや検証結果はキャッシュしません

source: Appendix 1
ja_jp: 付録1

source: Apple OpenID Connect Provider uses a `client_secret_post` method where a secret is a JWT produced with a `private_key_jwt` authentication method but with Apple account specific issuer and subject claims.
ja_jp: Apple OpenID Connect プロバイダーは `client_secret_post` メソッドを使用します。ここで、secret は `private_key_jwt` 認証メソッドで生成された JWT ですが、Apple アカウント固有の発行者とサブジェクトプロパティークレームを使用します。

source: Apple OpenID Connect Provider uses a `client_secret_post` method where a secret is a JWT produced with a `private_key_jwt` authentication method but with Apple account specific issuer and subject properties.
ja_jp: Apple OpenID Connect プロバイダーは `client_secret_post` メソッドを使用します。ここで、secret は `private_key_jwt` 認証メソッドで生成された JWT ですが、Apple アカウント固有の発行者とサブジェクトプロパティーを使用します。

source: Apple OpenID Connect Provider uses a `client_secret_post` method where a secret is a JWT produced with a `private_key_jwt` authentication method but with Apple account-specific issuer and subject properties.
ja_jp: Apple OpenID Connect プロバイダーは `client_secret_post` メソッドを使用します。ここで、シークレットは `private_key_jwt` 認証メソッドで生成された JWT ですが、Apple アカウント固有の発行者とサブジェクトプロパティーを使用します。

source: Apple OpenID Connect provider uses the `client_secret_post` method, where the secret is a JWT produced with the `private_key_jwt` authentication method, but with Apple account-specific issuer and subject properties.
ja_jp: Apple OpenID Connect プロバイダーは `client_secret_post` メソッドを使用します。ここでシークレットは `private_key_jwt` 認証方法で生成された JWT ですが、Apple アカウント固有の発行者とサブジェクトプロパティーを使用します。

source: Application Archives
ja_jp: アプリケーションアーカイブ

source: Application Configuration
ja_jp: アプリケーション設定

source: Application Data Caching
ja_jp: アプリケーションデータのキャッシング

source: Application Health
ja_jp: アプリケーションヘルス

source: Application Initialization and Termination
ja_jp: アプリケーションの初期化と終了

source: Application Metrics
ja_jp: アプリケーションメトリクス

source: Application class list
ja_jp: アプリケーションクラス一覧

source: Application complexity increases
ja_jp: アプリケーションの複雑性の増大

source: Application name
ja_jp: アプリケーション名

source: Application preparation
ja_jp: アプリケーションの準備

source: Application properties for `TokenSecuredResource`
ja_jp: `TokenSecuredResource` のアプリケーションプロパティー

source: Application properties support
ja_jp: アプリケーション・プロパティのサポート

source: Application requirements have changed drastically over the last few years. Reactive architecture is increasingly becoming the preferred approach for any application to succeed in the era of cloud computing, Big Data, or IoT. Today’s users embrace applications with milliseconds of response time, 100% uptime, lower latency, push data instead of pull, higher throughput, resilience, and elasticity. However, these features are nearly impossible to achieve using yesterday’s software architecture without a considerable investment in resources, infrastructure, and tooling. The world has changed, and having dozens of servers, long response times (> 500 ms), and downtime due to maintenance or waterfalls of failures does not meet the expected user experience. We need to build _better_ distributed systems, and that’s the motto of _reactive systems._
ja_jp: アプリケーションの要件は、ここ数年で劇的に変化しました。 リアクティブ アーキテクチャーは、クラウド コンピューティング、ビッグ データ、IoT の時代にアプリケーションが成功するための、ますます好ましいアプローチになりつつあります。 今日のユーザーは、応答時間が数ミリ秒、稼働率が 100%、レイテンシーが低い、プルではなくプッシュ データ、スループットが高く、回復力と弾力性があるアプリケーションを採用しています。 ただし、これらの機能は、リソース、インフラストラクチャー、ツールにかなりの投資をしなければ、従来のソフトウェア アーキテクチャーを使用して実現することはほぼ不可能です。 世界は変化しており、数十台のサーバー、長い応答時間 (> 500 ミリ秒)、メンテナンスや障害の滝によるダウンタイムでは、期待されるユーザー エクスペリエンスを満たせません。 私たちは、_より優れた_ 分散システムを構築する必要があり、それが _リアクティブ システム_ のモットーです。

source: Application requirements have changed drastically over the last few years. For any application to succeed in the era of cloud computing, Big Data, or IoT, going reactive is increasingly becoming the architecture style to follow.
ja_jp: アプリケーションの要件は、ここ数年で大きく変化しています。クラウドコンピューティング、ビッグデータ、IoTの時代にアプリケーションを成功させるためには、リアクティブにすることが、従うべきアーキテクチャのスタイルになりつつあります。
